Documents/ПланированиеПродажПоТочкамПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПланированиеПродажПоТочкамПродаж</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПланПродажТочекПродаж</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>План</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Январь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Февраль</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Март</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Апрель</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Май</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Июнь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Июль</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Август</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сентябрь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Октябрь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ноябрь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Декабрь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПланПродажТочекПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПланПродажТочекПродаж</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиПродаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПланированиеПродажПоТочкамПродаж/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//проверим, был ли введен по данному году и точке продаж документ ранее
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПланированиеПродажПоТочкамПродаж.Ссылка
	|ИЗ
	|	Документ.ПланированиеПродажПоТочкамПродаж КАК ПланированиеПродажПоТочкамПродаж
	|ГДЕ
	|	ПланированиеПродажПоТочкамПродаж.Год = &Год
	|	И ПланированиеПродажПоТочкамПродаж.Проведен = ИСТИНА
	|	И ПланированиеПродажПоТочкамПродаж.Ссылка <> &Ссылка
	|	И ПланированиеПродажПоТочкамПродаж.ТочкаПродаж = &ТочкаПродаж";
	Запрос.УстановитьПараметр("Год",Год);
	Запрос.УстановитьПараметр("ТочкаПродаж",ТочкаПродаж);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		Отказ = Истина;
		Сообщить("По данному году и точке продаж уже имеется проведенный документ плана: " + ВыборкаЗапроса.Ссылка,СтатусСообщения.Важное);
	КонецЦикла;
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	         	
	//запишем новые
	Движения.ПланПродажТочекПродаж.Записывать = Истина;
	Для Каждого СтрокаПлан Из План Цикл
		Движение = Движения.ПланПродажТочекПродаж.Добавить();
		НомерМесяц = 1;
		Движение.ТочкаПродаж = ТочкаПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Январь;
		
		Движение = Движения.ПланПродажТочекПродаж.Добавить();
		НомерМесяц = 2;
		Движение.ТочкаПродаж = ТочкаПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Февраль;
		
		Движение = Движения.ПланПродажТочекПродаж.Добавить();
		НомерМесяц = 3;
		Движение.ТочкаПродаж = ТочкаПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Март;
		
		Движение = Движения.ПланПродажТочекПродаж.Добавить();
		НомерМесяц = 4;
		Движение.ТочкаПродаж = ТочкаПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Апрель;
		
		Движение = Движения.ПланПродажТочекПродаж.Добавить();
		НомерМесяц = 5;
		Движение.ТочкаПродаж = ТочкаПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Май;
		
		Движение = Движения.ПланПродажТочекПродаж.Добавить();
		НомерМесяц = 6;
		Движение.ТочкаПродаж = ТочкаПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Июнь;
		
		Движение = Движения.ПланПродажТочекПродаж.Добавить();
		НомерМесяц = 7;
		Движение.ТочкаПродаж = ТочкаПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Июль;
		
		Движение = Движения.ПланПродажТочекПродаж.Добавить();
		НомерМесяц = 8;
		Движение.ТочкаПродаж = ТочкаПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Август;
		
		Движение = Движения.ПланПродажТочекПродаж.Добавить();
		НомерМесяц = 9;
		Движение.ТочкаПродаж = ТочкаПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Сентябрь;
		
		Движение = Движения.ПланПродажТочекПродаж.Добавить();
		НомерМесяц = 10;
		Движение.ТочкаПродаж = ТочкаПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Октябрь;
		
		Движение = Движения.ПланПродажТочекПродаж.Добавить();
		НомерМесяц = 11;
		Движение.ТочкаПродаж = ТочкаПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Ноябрь;
		
		Движение = Движения.ПланПродажТочекПродаж.Добавить();
		НомерМесяц = 12;
		Движение.ТочкаПродаж = ТочкаПродаж;
		Движение.Год = Год;
		Движение.Месяц = НачалоМесяца(Дата(Год,НомерМесяц,1,0,0,1));
		Движение.Номенклатура = СтрокаПлан.Номенклатура;
		Движение.Количество = СтрокаПлан.Декабрь;
		
	КонецЦикла;
	
КонецПроцедуры
